<template>
  <div :class="{'fixed':isScreen}" class="w-all flex al0 ab0 at0 al0 bc-fff fd-c ra-5 editor sha-card h-all">
    <div class="w-all bb-e flex ai-c pb3 pl3 fw">
      <div v-for="(item, index) in icons" class="rel" :class="item.name" :key="index">
        <div :title="item.title" @click.stop="btnAction(item)" class="w-28 h-28 flex ai-c jc-c ra-3 mt3 bc-fff mr3 hand lh-25 centers b-d" type="button">
          <svg style="fill:#888" viewBox="0 0 1024 1024" :width="item.size" :height="item.size">
            <path :d="item.icon"></path>
          </svg>
        </div>
        <div v-if="isModle=='fs'&&item.select" class="abs al0 at29">
          <ul @click="btnFontSize" class="sha-6 mt10 w-100 bc-fff pp10 h-130 autoy flex fw jc-b ra-5">
            <li :data-fs="index+1" v-for="(item, index) in fontSize" class="w-38 h-25 b-e flex ai-c hand jc-c ra-5 fs-12 fc-999 mt2" :key="index">{{item}}px</li>
          </ul>
        </div>
        <div v-if="isModle=='header'&&item.select" class="abs al0 at29">
          <div @click="btnHeader" class="sha-6 w-85 mt10 bc-fff pp10 flex fd-c ra-5">
            <h1 data-item='h1' class="pp10 hand">h1</h1>
            <h2 data-item='h2' class="pp10 hand">h2</h2>
            <h3 data-item='h3' class="pp10 hand">h3</h3>
            <h4 data-item='h4' class="pp10 hand">h4</h4>
            <h5 data-item='h5' class="pp10 hand">h5</h5>
            <h6 data-item='h6' class="pp10 hand">h6</h6>
          </div>
        </div>
        <div v-if="(isModle=='fc'||isModle=='bc')&&item.select" class="abs al0 at29">
          <div @click="btnColor" class="sha-6 mt10 bc-fff pp10 flex fd-c ra-5">
            <div class="fs-13">主题颜色<span class="fs-12 fc-aa">({{isModle=='fc'?'字体颜色':'背景颜色'}})</span></div>
            <ul class="flex w-200 mt10 jc-b ai-c">
              <li :data-color="item" v-for="(item, index) in colors.main" :key="index" :style="{'background-color':item}" class="flex hand h-15 w-15"></li>
            </ul>
            <div class="flex w-200 mt5 jc-b">
              <ul v-for="(item, index) in colors.plan" :key="index" class="flex fd-c ai-c">
                <li :data-color="child" v-for="(child, index) in item" :key="index" :style="{'background-color':child}" class="flex hand h-15 w-15"></li>
              </ul>
            </div>
            <div class="fs-13 mt10">标准颜色</div>
            <ul class="flex w-200 mt5 jc-b ai-c">
              <li :data-color="item" v-for="(item, index) in colors.hot" :key="index" :style="{'background-color':item}" class="flex hand h-15 w-15"></li>
            </ul>
          </div>
        </div>
        <div v-if="isModle=='image'&&item.select" class="abs al0 at29">
          <div class="sha-6 w-200 mt10 bc-fff pp10 flex fd-c ra-5">
            <div class="flex h-27 bb-e ai-c">
              <span @click="imageType=1" :class="{'fb bb-3':imageType==1}" class="w-60 hand centers h-all">上传图片</span>
              <span @click="imageType=2" :class="{'fb bb-3':imageType==2}" class="w-60 hand centers h-all">网络图片</span>
            </div>
            <div class="mt10 w-all">
              <div v-if="imageType==1" class="w-all rel">
                <div class="w-all flex ai-c jc-c">
                  <svg viewBox="0 0 1024 1024" style="fill:#aaa" xmlns="http://www.w3.org/2000/svg" p-id="39575" width="80" height="80">
                    <path
                      d="M52.736 128.512c-9.216 2.56-20.992 11.264-25.6 18.432-8.704 12.8-9.216 37.888-9.216 350.208 0 361.472-0.512 355.328 26.624 367.616 8.704 4.096 110.08 5.632 337.408 5.632h324.608l-17.92-26.112c-22.016-31.744-33.28-68.608-33.28-107.52 0-33.28 15.872-88.064 30.72-107.008l9.728-12.8-36.864-37.376-36.864-37.376L552.96 614.4l-69.12 71.68-94.208-117.76-94.72-117.76-93.696 140.8-93.696 140.8h-40.96V174.08H896v367.104l19.456 6.144c10.24 3.584 22.016 7.68 25.6 8.704 4.608 2.56 6.144-38.912 6.144-196.096 0-175.616-1.024-200.192-8.192-210.944-18.944-26.624-11.264-26.112-456.192-25.6-240.64 0-420.864 2.56-430.08 5.12z"
                      p-id="39576"></path>
                    <path
                      d="M693.76 270.848c-24.064 6.144-36.864 14.336-52.224 34.816-11.264 14.848-14.336 24.576-15.872 52.224-1.536 28.672 0 36.352 10.24 51.712 18.432 27.648 51.2 42.496 87.04 39.424 55.296-4.608 82.944-34.304 82.944-88.064 0-18.944-3.584-37.376-9.216-47.616-16.384-31.744-65.024-51.712-102.912-42.496zM794.112 589.312c-75.264 29.696-114.176 116.224-89.6 199.68 11.776 39.936 59.392 87.04 100.352 98.816 62.976 17.92 121.856 4.096 163.328-38.4 33.792-34.816 47.104-71.68 44.544-122.368-3.584-60.928-31.744-104.96-83.456-132.096-36.352-18.432-96.256-20.992-135.168-5.632z m103.424 99.328l39.936 43.52h-57.344l1.536 56.32 1.536 56.32h-53.76V732.672l-26.624-1.536-26.624-1.536 37.888-42.496c20.992-23.04 38.912-41.984 40.448-41.984 2.048 0 20.992 19.456 43.008 43.52z"
                      p-id="39577"></path>
                  </svg>
                </div>
                <input ref="input" @change="upfileImage(1)" accept="image/gif,image/jpeg,image/jpg,image/png,image/svg" class="abs op-0 w-all hand at0 ab0 ar0 ab0" type="file">
              </div>
              <div class="w-all flex fd-c ai-e" v-if="imageType==2">
                <input v-model="upImageFile" class="h-30 ra-5 b-d w-all pp10 fs-12" placeholder="输入网络图片地址" type="text">
                <button @click="upfileImage(2)" class="b-d w-50 bc-fff lh-20 mt6 fc-aa ra-5 fs-12">插入</button>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div ref="editor" autocorrect="off" autocomplete="off" @keydown="btnKeypress" spellcheck="false" @mouseleave="kenter" @mousedown="mousedown" v-on:mouseup="mouseup" v-on:keyup.enter="kenter" contenteditable="true" v-html="innerText" @input="changeText" @focus="isChange = false" @blur="blurFunc"
      class="h-all editors autoy flex-1 outline pp10 w-all"></div>
  </div>
</template>

<script lang='ts'>
import { Vue, Model, Prop, Watch } from 'vue-property-decorator';
export default class App extends Vue {
  @Model('modelValue', { type: String, default: "<p></p>" }) value!: string;
  @Prop({ type: Function }) upFile;
  $refs
  innerText = "";
  isChange = true
  isScreen = false
  upImageFile = ""
  selectedRange = null
  isModle = ''
  fontSize = [10, 13, 16, 18, 24, 32, 48]
  imageType = 1
  icons = [
    { size: 13, select: false, name: 'header', icon: 'M961.142857 950.857143q-25.142857 0-75.714286-2t-76.285714-2q-25.142857 0-75.428571 2t-75.428571 2q-13.714286 0-21.142857-11.714286t-7.428571-26q0-17.714286 9.714286-26.285714t22.285714-9.714286 29.142857-4 25.714286-8.571429q18.857143-12 18.857143-80l-0.571429-223.428571q0-12-0.571429-17.714286-7.428571-2.285714-28.571429-2.285714l-385.714286 0q-21.714286 0-29.142857 2.285714-0.571429 5.714286-0.571429 17.714286l-0.571429 212q0 81.142857 21.142857 93.714286 9.142857 5.714286 27.428571 7.428571t32.571429 2 25.714286 8.571429 11.428571 26q0 14.857143-7.142857 27.428571t-20.857143 12.571429q-26.857143 0-79.714286-2t-79.142857-2q-24.571429 0-73.142857 2t-72.571429 2q-13.142857 0-20.285714-12t-7.142857-25.714286q0-17.142857 8.857143-25.714286t20.571429-10 27.142857-4.285714 24-8.571429q18.857143-13.142857 18.857143-81.714286l-0.571429-32.571429 0-464.571429q0-1.714286 2.857143-14.857143t0-20.857143-0.857143-22-2-24-3.714286-20.857143-6.285714-18-9.142857-10.285714q-8.571429-5.714286-25.714286-6.857143t-30.285714-1.142857-23.428571-8-10.285714-25.714286q0-14.857143 6.857143-27.428571t20.571429-12.571429q26.285714 0 79.142857 2t79.142857 2q24 0 72.285714-2t72.285714-2q14.285714 0 21.428571 12.571429t7.142857 27.428571q0 17.142857-9.714286 24.857143t-22 8.285714-28.285714 2.285714-24.571429 7.428571q-20 12-20 91.428571l0.571429 182.857143q0 12 0.571429 18.285714 7.428571 1.714286 22.285714 1.714286l399.428571 0q14.285714 0 21.714286-1.714286 0.571429-6.285714 0.571429-18.285714l0.571429-182.857143q0-79.428571-20-91.428571-10.285714-6.285714-33.428571-7.142857t-37.714286-7.428571-14.571429-28.285714q0-14.857143 7.142857-27.428571t21.428571-12.571429q25.142857 0 75.428571 2t75.428571 2q24.571429 0 73.714286-2t73.714286-2q14.285714 0 21.428571 12.571429t7.142857 27.428571q0 17.142857-10 25.142857t-22.857143 8.285714-29.428571 1.714286-25.142857 7.142857q-20 13.142857-20 92l0.571429 538.857143q0 68 19.428571 80 9.142857 5.714286 26.285714 7.714286t30.571429 2.571429 23.714286 8.857143 10.285714 25.428571q0 14.857143-6.857143 27.428571t-20.571429 12.571429z', type: 'header', title: '标题' },
    { size: 13, name: 'quote', icon: 'M872.369231 128c-177.230769 0-313.107692 137.846154-313.107693 315.076923V866.461538c0 15.753846 13.784615 29.538462 29.538462 29.538462h334.769231c15.753846 0 29.538462-13.784615 29.538461-29.538462V531.692308c0-15.753846-13.784615-29.538462-29.538461-29.538462H677.415385v-59.076923c0-98.461538 96.492308-196.923077 194.953846-196.923077h51.2c15.753846 0 29.538462-13.784615 29.538461-29.538461V157.538462c0-15.753846-13.784615-29.538462-29.538461-29.538462h-51.2z m-488.369231 0c-177.230769 0-313.107692 137.846154-313.107692 315.076923V866.461538c0 15.753846 13.784615 29.538462 29.538461 29.538462h334.769231c15.753846 0 29.538462-13.784615 29.538462-29.538462V531.692308c0-15.753846-13.784615-29.538462-29.538462-29.538462H189.046154v-59.076923c0-98.461538 96.492308-196.923077 194.953846-196.923077h51.2c15.753846 0 29.538462-13.784615 29.538462-29.538461V157.538462c0-15.753846-13.784615-29.538462-29.538462-29.538462h-51.2z', type: 'quote', title: '引用' },
    { size: 18, name: 'fs', icon: 'M296.152 587.982l89.392-288.243 89.61 288.243H296.151m169.934-398.82h-136.23l-203.84 645.676h94.45l48.225-153.667h236.155l49.014 153.667h118.296L466.086 189.16m214.128 496.062l51.859-137.725 51.88 137.725h-103.74m98.502-201.847h-78.918L636.415 654.41l27.467 86.184 0.395-1.244h136.826l28.466 88.906h68.412L778.715 483.376', type: 'fs', title: '字体大小' },
    { size: 22, name: 'image', icon: 'M811.272038 156.318208l-595.873246 0c-46.818305 0-85.124749 38.306444-85.124749 85.124749l0 535.616884c0 46.818305 38.306444 85.124749 85.124749 85.124749l595.873246 0c46.818305 0 85.124749-38.306444 85.124749-85.124749l0-535.616884C896.396787 194.624652 858.090343 156.318208 811.272038 156.318208zM318.595129 255.961626c42.952254 0 77.771271 34.819017 77.771271 77.771271s-34.819017 77.771271-77.771271 77.771271-77.771271-34.819017-77.771271-77.771271S275.642874 255.961626 318.595129 255.961626zM215.398792 734.497467l148.9678-197.609637 106.405425 127.687124 148.968823-191.530175 191.530175 261.45371L215.398792 734.49849z', type: '', title: '上传图片' },
    { size: 13, name: 'bold', icon: 'M385.692278 918.576916 390.80771 919.307658C421.012953 920.769221 443.423035 921.499963 458.03843 921.499963 545.73119 921.499963 609.551045 905.545019 649.499963 873.63458 689.448881 841.724219 709.423104 790.449073 709.423104 719.807724 709.423104 655.986846 690.66689 608.365568 653.153831 576.942316 615.640852 545.519065 559.372209 529.807675 484.346171 529.807675 462.422961 529.807675 444.153935 530.051308 429.538462 530.538496 414.922988 531.025605 400.307751 531.756426 385.692278 532.730801L385.692278 918.576916ZM386.423099 445.769255C390.320522 446.256443 395.192241 446.621775 401.038494 446.865408 406.884667 447.108962 415.410176 447.23074 426.615414 447.23074 504.5645 447.23074 561.929295 431.51935 598.711532 400.096177 635.49377 368.672926 653.884652 319.590085 653.884652 252.846159 653.884652 194.384345 636.833477 151.025822 602.730732 122.76925 568.628066 94.512679 516.256768 80.38463 445.615419 80.38463 433.922993 80.38463 415.410412 81.358927 390.076889 83.307678L385.692278 83.307678 386.423099 445.769255ZM78.769231 0 528.192276 0C638.295434 0 721.115136 19.608812 776.653824 58.82691 832.192591 98.045086 859.961502 156.62781 859.961502 234.576896 859.961502 293.525898 841.936108 342.852372 805.884613 382.557657 769.833118 422.26302 716.731156 451.371717 646.576916 469.884613 732.320926 471.346176 799.063828 493.268992 846.80767 535.653849 894.551513 578.038705 918.423079 636.499653 918.423079 711.038425 918.423079 805.551734 886.026004 878.018954 821.23075 928.442289 756.435574 978.865625 663.141612 1004.076898 541.346186 1004.076898L78.769231 1004.076898 78.769231 931.000005 167.19234 922.961526 191.307697 899.576911 191.307697 101.57694 167.19234 80.38463 78.769231 73.076894 78.769231 0Z', type: 'cmd', title: '加粗' },
    { size: 13, name: 'italic', icon: 'M682.666667 85.333333L512 938.666667h170.666667v85.333333H170.666667v-85.333333h170.666666L512 85.333333H341.333333V0h512v85.333333H682.666667z', type: 'cmd', title: '斜体' },
    { size: 13, name: 'underline', icon: 'M0 945.230769 945.230769 945.230769 945.230769 1024 0 1024 0 945.230769ZM0 0 407.076943 0 407.076943 61.934356 319.153861 68.127823 299.076923 86.088783 299.076923 530.158041C299.076923 614.802038 317.076716 675.290663 353.076933 711.625649 389.077071 747.960635 448.153442 766.127892 530.307702 766.127892 606.000364 766.127892 660.807522 746.825177 694.730752 708.219274 728.653982 669.613371 745.61536 606.337733 745.61536 518.390469L745.61536 91.043525 724.153817 69.366469 633.461524 61.934356 633.461524 0 955.384596 0 955.384596 61.934356 868.846119 69.366469 849.461563 91.043525 849.461563 531.396687C849.461563 649.072561 819.923338 734.334661 760.846178 787.185585 701.76894 840.03651 606.462188 866.461538 474.923087 866.461538 406.153531 866.461538 345.807951 857.481137 293.884613 839.520098 241.961275 821.55906 201.230887 795.856581 171.692347 762.411796 149.076834 735.986373 133.038474 705.74206 123.57695 671.677991 114.115348 637.613922 109.384625 588.789524 109.384625 525.203298L109.384625 86.088783 89.307687 68.127823 0 61.934356 0 0Z', type: 'cmd', title: '下划线' },
    { size: 13, name: 'strikethrough', icon: 'M965.612 470.938H722.089c-13.491-12.97-27.55-24.28-42.189-33.9-23.926-15.693-57.6-33.377-101.023-53.038-43.433-19.656-72.192-33.014-86.277-40.054-43.136-20.833-64.706-53.852-64.706-99.046 0-25.528 8.069-48.64 24.212-69.33 16.138-20.69 38-33.08 65.593-37.197 14.668-2.345 25.528-3.522 32.568-3.522 44.902 0 83.338 15.114 115.328 45.337 24.94 20.839 44.749 48.348 59.428 82.535 14.669 34.19 22.005 55.982 22.005 65.367h26.855l-12.77-259.712h-23.331c0 13.501-2.35 24.212-7.04 32.133-6.754 8.514-13.942 12.764-21.57 12.764-6.462 0-13.8-2.345-22.012-7.045-36.684-19.656-68.229-32.42-94.638-38.293-26.409-5.867-62.658-8.806-108.723-8.806-63.683 0.88-117.463 20.03-161.331 57.446-43.873 37.417-68.89 93.978-75.05 169.698 0 74.245 19.513 130.227 58.543 167.93 5.919 5.72 12.2 11.285 18.775 16.727H64.486v72.561h386.125c4.972 2.033 10 4.045 15.135 6.011 52.234 19.082 90.824 43.873 115.768 74.388 24.94 30.526 37.417 76.155 37.417 136.899-4.992 37.269-20.91 65.813-47.76 85.617-26.848 19.809-57.88 29.716-93.096 29.716-40.791 0-74.988-12.032-102.564-36.096-33.167-27.878-57.078-61.256-71.752-100.147-14.679-38.881-22.01-65.654-22.01-80.333h-21.566l-11.003 277.76h27.29c0-15.55 5.284-27.581 15.846-36.096 5.868-3.522 11.884-5.284 18.048-5.284 5.868 0 13.788 2.356 23.772 7.045 49.004 32.87 117.53 50.325 205.568 52.383 39.02 0 71.45-3.676 97.28-11.003 35.216-9.687 65.51-28.175 90.9-55.465 25.38-27.29 44.524-59.494 57.442-96.62 12.908-37.12 19.369-75.934 19.369-116.428 0-50.918-9.2-95.027-27.571-132.347h188.488v-72.555z', type: 'cmd', title: '删除线' },
    { size: 13, name: 'fc', icon: 'M648.272501 0H384.768171L0.000682 1024h242.952698l77.34577-255.829447h382.038641l78.710193 255.829447h244.317122zM369.418404 599.408394l120.069287-336.330446a367.541639 367.541639 0 0 0 18.334444-86.55563h6.139906a380.759494 380.759494 0 0 0 16.287808 89.284477l119.387076 333.686876H369.418404z', type: '', title: '字体颜色' },
    { size: 13, name: 'bc', icon: 'M896 384c-46.72-46.72-160.64-25.6-219.52-10.24L448.64 152.96l-21.76 21.76L313.6 65.28 223.36 152.96 336.64 262.4 66.56 524.16v2.56L448.64 896l359.68-349.44L960 693.12S960 448 896 384zM194.56 524.16l255.36-247.68 254.72 247.68H194.56z', type: '', title: '背景色' },
    { size: 13, name: 'justifyLeft', icon: 'M0 0h1228.8v204.8H0V0z m0 409.6h1228.8v204.8H0V409.6z m0 409.6h614.4v204.8H0V819.2z', type: 'cmd', title: '居左' },
    { size: 13, name: 'justifyCenter', icon: 'M307.2 0h614.4v204.8H307.2V0zM0 409.6h1228.8v204.8H0V409.6z m307.2 409.6h614.4v204.8H307.2V819.2z', type: 'cmd', title: '居中' },
    { size: 13, name: 'justifyRight', icon: 'M0 0h1228.8v204.8H0V0z m0 409.6h1228.8v204.8H0V409.6z m614.4 409.6h614.4v204.8H614.4V819.2z', type: 'cmd', title: '居右' },
    { size: 13, name: 'insertOrderedList', icon: 'M256 85.333C256 38.205 294.085 0 341.124 0h597.752C985.89 0 1024 37.876 1024 85.333c0 47.129-38.085 85.334-85.124 85.334H341.124C294.11 170.667 256 132.79 256 85.333zM85.333 0h85.334v85.333H85.333V0zM256 512c0-47.128 38.085-85.333 85.124-85.333h597.752c47.013 0 85.124 37.876 85.124 85.333 0 47.128-38.085 85.333-85.124 85.333H341.124C294.11 597.333 256 559.457 256 512z m0 426.667c0-47.129 38.085-85.334 85.124-85.334h597.752c47.013 0 85.124 37.877 85.124 85.334 0 47.128-38.085 85.333-85.124 85.333H341.124C294.11 1024 256 986.124 256 938.667zM0 0h85.333v85.333H0V0z m85.333 170.667h85.334V256H85.333v-85.333z m0-85.334h85.334v85.334H85.333V85.333zM0 341.333h85.333v85.334H0v-85.334z m85.333 0h85.334v85.334H85.333v-85.334z m0 85.334h85.334V512H85.333v-85.333zM0 512h85.333v85.333H0V512z m0 85.333h85.333v85.334H0v-85.334z m85.333 0h85.334v85.334H85.333v-85.334zM0 768h85.333v85.333H0V768z m85.333 0h85.334v85.333H85.333V768z m0 85.333h85.334v85.334H85.333v-85.334z m0 85.334h85.334V1024H85.333v-85.333z m-85.333 0h85.333V1024H0v-85.333z', type: '', title: '有序列表' },
    { size: 13, name: 'insertUnorderedList', icon: 'M255.999 85.332C255.999 38.205 294.084 0 341.124 0h597.749c47.015 0 85.125 37.877 85.125 85.332 0 47.13-38.085 85.335-85.125 85.335H341.124c-47.015 0-85.125-37.877-85.125-85.335z m0 426.667c0-47.127 38.085-85.332 85.125-85.332h597.749c47.015 0 85.125 37.875 85.125 85.332 0 47.13-38.085 85.33-85.125 85.33H341.124c-47.015-0.001-85.125-37.871-85.125-85.33z m0 426.668c0-47.13 38.085-85.34 85.125-85.34h597.749c47.015 0 85.125 37.88 85.125 85.34 0 47.125-38.085 85.33-85.125 85.33H341.124c-47.015 0-85.125-37.88-85.125-85.33zM0 510.291c0-47.127 38.085-85.332 85.125-85.332h9.595c47.015 0 85.125 37.877 85.125 85.332 0 47.127-38.085 85.337-85.125 85.337h-9.595C38.11 595.628 0 557.748 0 510.291z m0 0c0-47.127 38.085-85.332 85.125-85.332h9.595c47.015 0 85.125 37.877 85.125 85.332 0 47.127-38.085 85.337-85.125 85.337h-9.595C38.11 595.628 0 557.748 0 510.291zM0 85.332C0 38.205 38.085 0 85.125 0h9.595c47.015 0 85.125 37.877 85.125 85.332 0 47.127-38.085 85.337-85.125 85.337h-9.595C38.11 170.669 0 132.79 0 85.332z m0 853.326c0-47.125 38.085-85.33 85.125-85.33h9.595c47.015 0 85.125 37.88 85.125 85.33 0 47.13-38.085 85.34-85.125 85.34h-9.595C38.11 1023.997 0 986.117 0 938.658z', type: '', title: '无序列表' },
    { size: 13, name: 'indent', icon: 'M261.438-0.001h756.65v252.216h-756.65V0zM9.222 385.89h1008.867v252.217H9.222V385.89zM9.222 771.782h1008.867v252.217H9.222V771.782zM5.911-0.001l226.995 126.108L5.911 252.215z', type: 'cmd', title: '首行缩进' },
    { size: 18, name: 'formatmatch', icon: 'M293.5 463.9H767c44.2 0 61.4 106 61.6 224 0.2 118-44.3 224-79.6 224H640.9c-4.1 0-6.9-4.1-5.4-7.9 5.1-13 13.7-39.6 9.9-63-5.3-32.4-16.5-58.8-16.5-58.8s8.3 23.9-25.8 68.7c-31.2 41-58.9 55.7-68.1 59.7-1.9 0.8-3.9 1.3-6 1.3H184.2c-24.3 0-44-20.2-43-44.8 0.3-7.4 2.6-14.7 6.5-21l48.7-81.2c35.5-59.1 54.2-126.8 54.2-195.7V507c-0.1-23.8 19.2-43.1 42.9-43.1z m213.7-158.1V155.1c0-23.8 19.3-43.1 43.1-43.1s43.1 19.3 43.1 43.1v150.7h160.8c23.8 0 43.1 19.3 43.1 43.1V392c0 23.8-19.3 43.1-43.1 43.1H323.5c-23.8 0-43.1-19.3-43.1-43.1v-43.1c0-23.8 19.3-43.1 43.1-43.1h183.7z', type: '', title: '格式化为纯文本)' },
    { size: 18, name: 'fullscreen', icon: 'M747.1 116.6H280.9c-90.1 0-163.5 73.4-163.5 163.5v466.2c0 90.1 73.4 163.5 163.5 163.5h466.2c90.1 0 164.1-73.4 163.5-163.5V280.1c0-90.2-73.3-163.5-163.5-163.5z m-363 713.6H233.6c-20.5 0-37.9-16.8-38.5-38.5V641.3c0-21.1 16.8-37.9 37.9-37.9 10.6 0 19.9 4.4 26.7 11.2 6.8 6.8 11.2 16.8 11.2 26.7v58.4l136.2-136.2c14.9-14.9 39.2-14.9 54.1 0 14.9 14.9 14.9 39.2 0 54.1L325 753.8h58.4c21.1 0 37.9 16.8 37.9 37.9s-16.1 38.5-37.2 38.5z m257.5-642.8H792c20.5 0 37.9 16.8 38.5 38.5v150.4c0 21.1-16.8 37.9-37.9 37.9-10.6 0-19.9-4.4-26.7-11.2-6.8-6.8-11.2-16.8-11.2-26.7V318L618.5 454.2c-14.9 14.9-39.2 14.9-54.1 0-14.9-14.9-14.9-39.2 0-54.1l136.2-136.2h-58.4c-21.1 0-37.9-16.8-37.9-37.9s16.1-38.6 37.3-38.6z', type: '', title: '全屏' },
  ]
  colors = {
    main: ['#000000', '#ffffff', '#eeece1', '#1e497b', '#4e81bb', '#e2534d', '#9aba60', '#8165a0', '#47acc5', '#f9974c'],
    hex: [['#7f7f7f', '#f2f2f2'], ['#0d0d0d', '#808080'], ['#1c1a10', '#ddd8c3'], ['#0e243d', '#c6d9f0'], ['#233f5e', '#dae5f0'], ['#632623', '#f2dbdb'], ['#4d602c', '#eaf1de'], ['#3f3150', '#e6e0ec'], ['#1e5867', '#d9eef3'], ['#99490f', '#fee9da']],
    hot: ['#c21401', '#ff1e02', '#ffc12a', '#ffff3a', '#90cf5b', '#00af57', '#00afee', '#0071be', '#00215f', '#72349d'],
    plan: []
  }

  @Watch('modelValue')
  changeValue(newVal, oldVal) {
    if (this.isChange) {
      this.innerText = this.value
    }
  }

  btnKeypress(e) {
    if (e.keyCode == 8 && e.srcElement.innerHTML == "") {
      this.btnCommand('insertHTML', '<p>&nbsp;</p>');
    }
  }
  kenter(e) {
    this.saveSelection();
  }
  closeModel() {
    this.icons.forEach(v => { v.select = false });
    this.isModle = "";
  }
  mousedown(e) {
    this.closeModel();
  }
  upfileImage(type) {
    if (type == 2) {
      let html = `<img style="max-width:100%;border-radius:4px;" src=${this.upImageFile}>`;
      this.btnCommand('insertHTML', html);
      this.upImageFile = "";
    } else {
      let input = this.$refs.input
      let files = input.files
      this.upFile(files[0]).then(res => {
        let html = `<img style="max-width:100%;border-radius:4px;" src=${res}>`;
        this.btnCommand('insertHTML', html);
      })
    }
  }

  // 鼠标事件
  mouseup() {
    this.saveSelection();
  }
  btnAction(item) {
    this.closeModel();
    if (item.type == 'cmd') {
      this.btnCommand(item.name);
    } else if (item.name == 'quote') {
      let html = `<div style="padding: 15px;margin: 10px 0;border-left: 5px solid #00a3cf;background: #f6f6f6;"><p><br></p></div>`;
      this.btnCommand('insertHTML', html);
      var p = document.createElement('p');
      p.innerHTML = '<br>';
      this.$refs.editor.appendChild(p)
    } else if (['fc', 'bc', 'fs', 'image', 'header'].includes(item.name)) {
      item.select = true;
      this.isModle = item.name;
    } else if (item.name == 'insertOrderedList') {
      let html = `<ol><li style="margin-left: 15px;list-style-type: inherit;"></li></ol>`;
      this.btnCommand('insertHTML', html);
    } else if (item.name == 'insertUnorderedList') {
      let html = `<ul><li style="margin-left: 15px;list-style-type: inherit;"></li></ul>`;
      this.btnCommand('insertHTML', html);
    } else if (item.name == 'formatmatch') {
      // this.$emit('input', this.$refs.editor.innerText)
      this.$emit('update:modelValue', this.$refs.editor.innerText);
    } else if (item.name == 'fullscreen') {
      if (this.isScreen) {
        this.isScreen = false;
      } else {
        this.isScreen = true;
      }
    }
  }
  btnFontSize(e) {
    if (e.target.dataset.fs) {
      console.log(e.target.dataset.fs)
      this.btnCommand('fontsize', parseInt(e.target.dataset.fs));
    }
  }
  btnHeader(e) {
    if (e.target.dataset.item) {
      this.btnCommand('formatBlock', e.target.dataset.item);
    }
  }
  btnColor(e) {
    if (e.target.dataset.color) {
      this.btnCommand(this.isModle == 'fc' ? 'foreColor' : 'hiliteColor', e.target.dataset.color);
    }
  }
  changeText(e) {
    // this.$emit('input', e.srcElement.innerHTML)
    this.$emit('update:modelValue', e.srcElement.innerHTML);
  }
  btnCommand(cmd, html: any = "") {
    html = html ? html : false;
    this.restoreSelection();
    this.$refs.editor.focus();
    document.execCommand(cmd, false, html);
    this.closeModel();
  }
  blurFunc() {
    this.isChange = true;
  }
  getCurrentRange() {
    //获取当前range
    if (window.getSelection) {
      //使用 window.getSelection() 方法获取鼠标划取部分的起始位置和结束位置
      var sel: any = window.getSelection();
      if (sel.rangeCount > 0) {
        //通过selection对象的getRangeAt方法来获取selection对象的某个Range对象
        return sel.getRangeAt(0);
      }
    } else if ((document as any).selection) {
      var sel = (document as any).selection;
      return sel.createRange();
    }
    return null;
  }
  saveSelection() {
    this.selectedRange = this.getCurrentRange();
  }
  restoreSelection() { //重置为上个range
    var selection: any = window.getSelection();
    if (this.selectedRange) {
      try {
        selection.removeAllRanges();
      } catch (ex) {
        (document.body as any).createTextRange().select();
        (document as any).selection.empty();
      };
      selection.addRange(this.selectedRange);
    }
  }

  getSelectionHTML() {
    if (window.getSelection) {
      var sel: any = window.getSelection();
      if (sel.rangeCount > 0) {
        return sel;
      }
    }
  }
  // 格式化 hex 颜色值
  parseColor(hexStr) {
    if (hexStr.length === 4) {
      hexStr = '#' + hexStr[1] + hexStr[1] + hexStr[2] + hexStr[2] + hexStr[3] + hexStr[3]
    } else {
      return hexStr
    }
  }
  // RGB 颜色 转 HEX 颜色
  rgbToHex(r, g, b) {
    let hex = ((r << 16) | (g << 8) | b).toString(16)
    return '#' + new Array(Math.abs(hex.length - 7)).join('0') + hex
  }
  // HEX 转 RGB 颜色
  hexToRgb(hex: any) {
    hex = this.parseColor(hex)
    let rgb: any = []
    for (let i = 1; i < 7; i += 2) {
      rgb.push(parseInt('0x' + hex.slice(i, i + 2)))
    }
    return rgb
  }
  // 计算渐变过渡颜色
  gradient(startColor, endColor, step) {
    // 讲 hex 转换为 rgb
    let sColor = this.hexToRgb(startColor)
    let eColor = this.hexToRgb(endColor)

    // 计算R\G\B每一步的差值
    let rStep = (eColor[0] - sColor[0]) / step
    let gStep = (eColor[1] - sColor[1]) / step
    let bStep = (eColor[2] - sColor[2]) / step


    let gradientColorArr: any = []
    // 计算每一步的hex值
    for (let i = 0; i < step; i++) {
      gradientColorArr.push(this.rgbToHex(parseInt(rStep * i + sColor[0]), parseInt(gStep * i + sColor[1]), parseInt(bStep * i + sColor[2])))
    }
    gradientColorArr.push(endColor)
    return gradientColorArr
  }

}
</script>

<style lang='less'>
</style>